Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/library.tmx
Source language: en
Languages: pl

source: If the submitted form data contains more than one field with the same name, the object retrieved by ``form[key]`` is not a :class:`FieldStorage` or :class:`MiniFieldStorage` instance but a list of such instances. Similarly, in this situation, ``form.getvalue(key)`` would return a list of strings. If you expect this possibility (when your HTML form contains multiple fields with the same name), use the :func:`getlist` function, which always returns a list of values (so that you do not need to special-case the single item case). For example, this code concatenates any number of username fields, separated by commas::
pl: Jeśli przekazane dane formularza zawierają więcej niż jedno pole o tej samej nazwie, przedmiot otrzymany przez wywołanie ``form[key]`` nie jest przykładem :class:`FieldStorage` lub :class:`MiniFieldStorage` ale listą takich przykładów. Podobnie w tej sytuacji, ``form.getvalue(key)`` zwróciłoby listę ciągów znaków. Jeśli oczekujesz tej możliwości (kiedy twój formularz HTML zawiera wiele pól o tej samej nazwie) użyj zadania :func:`getlist`, które zawsze zwraca listę wartości (tak że nie potrzebujesz szczególnego przypadku dla przypadku pojedynczego elementu). Dla przykładu ten kod łączy dowolną liczbę pól nazwy użytkownika oddzielonych przez przecinki::

source: If a field represents an uploaded file, accessing the value via the :attr:`value` attribute or the :func:`getvalue` method reads the entire file in memory as a string. This may not be what you want. You can test for an uploaded file by testing either the :attr:`filename` attribute or the :attr:`!file` attribute. You can then read the data at leisure from the :attr:`!file` attribute::
pl: Jeśli pole reprezentuje załadowany plik, dostęp do wartości przez właściwość :attr:`value` lub sposób postępowania :func:`getvalue` wczytuje cały plik do pamięci jako ciąg znaków. To może nie być tym czego oczekujesz. Możesz sprawdzić załadowany plik przez przetestowanie albo właściwości :attr:`filename` albo właściwości :attr:`!file`. Możesz wtedy wczytać dane w czasie wolnym z właściwości :attr:`!file`::

source: fileitem = form["userfile"] if fileitem.file: # It's an uploaded file; count lines linecount = 0 while True: line = fileitem.file.readline() if not line: break linecount = linecount + 1
pl: fileitem = form["userfile"] if fileitem.file: # to załadowany plik; zlicz linie linecount = 0 while True: line = fileitem.file.readline() if not line: break linecount = linecount + 1

source: If an error is encountered when obtaining the contents of an uploaded file (for example, when the user interrupts the form submission by clicking on a Back or Cancel button) the :attr:`done` attribute of the object for the field will be set to the value -1.
pl: Jeśli napotkany zostanie błąd podczas otrzymywania zawartości załadowanego pliku (dla przykładu, gdy użytkownik przerwie działanie formularza przez kliknięcie przycisku Wstecz lub Anuluj) właściwość :attr:`done` przedmiotu dla pola zostanie ustawiona na wartość -1.

source: The file upload draft standard entertains the possibility of uploading multiple files from one field (using a recursive :mimetype:`multipart/\*` encoding). When this occurs, the item will be a dictionary-like :class:`FieldStorage` item. This can be determined by testing its :attr:`!type` attribute, which should be :mimetype:`multipart/form-data` (or perhaps another MIME type matching :mimetype:`multipart/\*`). In this case, it can be iterated over recursively just like the top-level form object.
pl: Standard ładowania pliku przewiduje możliwość załadowania wielu plików z jednego pola (używając rekursywnego kodowania :mimetype:`multipart/\*`). Gdy to się zdarzy, element będzie słowniko-podobnym elementem :class:`FieldStorage`. To może być określone przez sprawdzenie właściwości :attr:`!type`, która powinna być :mimetype:`multipart/form-data` (lub byćmoże inny typ MIME pasujący do :mimetype:`multipart/\*`). W tym przypadku może być on iterowany rekursywnie tak, jak przedmiot formularza nadrzędnego poziomu.

source: When a form is submitted in the "old" format (as the query string or as a single data part of type :mimetype:`application/x-www-form-urlencoded`), the items will actually be instances of the class :class:`MiniFieldStorage`. In this case, the :attr:`!list`, :attr:`!file`, and :attr:`filename` attributes are always ``None``.
pl: Gdy formularz jest podawany w "starym" formacie (jako ciąg zapytania lub pojedyncza część danych typu :mimetype:`application/x-www-form-urlencoded`), wszystkie elementy właściwie będą przykładami uogólnienia :class:`MiniFieldStorage`. W tym przypadku, właściwości :attr:`!list`, :attr:`!file`, i :attr:`filename` są zawsze ``None``.

source: A form submitted via POST that also has a query string will contain both :class:`FieldStorage` and :class:`MiniFieldStorage` items.
pl: Formularz podany przez sposób postępowania POST który także zawiera ciąg zapytania będzie zawierał zarówno elementy :class:`FieldStorage` jak i :class:`MiniFieldStorage`.

source: Higher Level Interface
pl: Sprzęg Wyższego Poziomu (Higher Level Interface)

source: The previous section explains how to read CGI form data using the :class:`FieldStorage` class. This section describes a higher level interface which was added to this class to allow one to do it in a more readable and intuitive way. The interface doesn't make the techniques described in previous sections obsolete --- they are still useful to process file uploads efficiently, for example.
pl: Poprzednia sekcja wyjaśnia jak czytać dane z formularza CGI używając uogólnienia :class:`FieldStorage`. Ten rozdział opisuje sprzęg wyższego rzędu, który został dodany do tego uogólnienia aby pozwolić robić to w bardziej czytelny i intuicyjny sposób. Sprzęg nie powoduje że techniki opisane w poprzednich rozdziałach stają się zbędne --- one są wciąż użyteczne aby wykonywać ładowanie plików efektywnie, dla przykładu.

source: The interface consists of two simple methods. Using the methods you can process form data in a generic way, without the need to worry whether only one or more values were posted under one name.
pl: Sprzęg składa się z dwóch prostych sposobów postępowania. Używając sposobów postępowania możesz przetwarzać dane w zastępczy sposób bez konieczności martwienia się czy tylko jedna czy więcej danych zostało opublikowanych pod daną nazwą.

source: In the previous section, you learned to write following code anytime you expected a user to post more than one value under one name::
pl: W poprzednim rozdziale, dowiedziałeś się jak pisać następujący kod za każdym razem gdy spodziewałeś się że użytkownik opublikuje więcej niż jedną wartość pod jedną nazwą::

source: item = form.getvalue("item") if isinstance(item, list): # The user is requesting more than one item. else: # The user is requesting only one item.
pl: item = form.getvalue("item") if isinstance(item, list): # Użytkownik oczekuje więcej niż jednej rzeczy. else: # Użytkownik oczekuje tylko jednej rzeczy.

source: This situation is common for example when a form contains a group of multiple checkboxes with the same name::
pl: Ta sytuacja jest obecna dla przykładu gdy formularz zawiera grupę wielu pól zaznaczania o tej samej nazwie::

source: In most situations, however, there's only one form control with a particular name in a form and then you expect and need only one value associated with this name. So you write a script containing for example this code::
pl: W większości przypadków, jednakże, istnieje tylko jedna urządzenie formularza o określonej nazwie w formularzu i wtedy oczekujesz i potrzebujesz tylko jednej wartości powiązanej z tą nazwą. Więc piszesz skrypt zawierający dla przykładu ten kod::

source: The problem with the code is that you should never expect that a client will provide valid input to your scripts. For example, if a curious user appends another ``user=foo`` pair to the query string, then the script would crash, because in this situation the ``getvalue("user")`` method call returns a list instead of a string. Calling the :meth:`~str.upper` method on a list is not valid (since lists do not have a method of this name) and results in an :exc:`AttributeError` exception.
pl: Problem z kodem polega na tym, że nigdy nie powinieneś oczekiwać, że klient dostarczy właściwe wpisy do twoich skryptów. Dla przykładu, jeśli ciekawy użytkownik dołoży jeszcze jedną parę ``user=foo`` do ciągu zapytania, wtedy skrypt ulegnie wypadkowi, ponieważ w tej sytuacji wywołanie sposobu postępowania ``getvalue("user")`` zwróci listę zamiast ciągu znaków. Wywołanie sposobu postępowania :meth:`~str.upper` na liście nie jest prawidłowe (gdyż listy nie mają sposobów postępowania o tej nazwie) i kończy się wyjątkiem :exc:`AttributeError`.

source: Therefore, the appropriate way to read form data values was to always use the code which checks whether the obtained value is a single value or a list of values. That's annoying and leads to less readable scripts.
pl: Zatem, właściwym sposobem aby wczytywać dane formularza było zawsze używanie kodu który sprawdza czy otrzymana wartość jest pojedynczą wartością czy listą wartości. To jest irytujące i prowadzi do mniej czytelnych skryptów.

source: A more convenient approach is to use the methods :meth:`getfirst` and :meth:`getlist` provided by this higher level interface.
pl: Bardziej użyteczne podejście polega na tym aby używać sposobów postępowania :meth:`getfirst` i :meth:`getlist` dostarczanych przez sprzęg wyższego poziomu.

source: This method always returns only one value associated with form field *name*. The method returns only the first value in case that more values were posted under such name. Please note that the order in which the values are received may vary from browser to browser and should not be counted on. [#]_ If no such form field or value exists then the method returns the value specified by the optional parameter *default*. This parameter defaults to ``None`` if not specified.
pl: Ten sposób postępowania zawsze zwraca tylko jedną wartość związaną z polem formularza *name*. Sposób postępowania zwraca tylko pierwszą wartość w przypadku gdy więcej wartości zostało opublikowanych pod taką nazwą. Proszę zauważ że kolejność w jakiej wartości są otrzymywane może różnić się między przeglądarkami i nie powinien liczyć się. [#]_ Jeśli żadne takie pole formularza ani wartość nie istnieje wtedy sposób postępowania zwraca wartość określoną przez opcjonalny parametr *domyślny* - z ang - *default*. Ten parametr domyślnie równy jest ``None`` jeśli nie jest określony.

source: This method always returns a list of values associated with form field *name*. The method returns an empty list if no such form field or value exists for *name*. It returns a list consisting of one item if only one such value exists.
pl: Ten sposób postępowania zawsze zwraca listę wartości związaną z polem formularza *name*. Ten sposób postępowania zwraca pustą listę jeśli żadne pole ani wartość nie istnieje dla *nazwy* - z ang. - *name*. Zwraca listę składającą się z jednego elementu jeśli tylko jedna taka wartość istnieje.

source: Using these methods you can write nice compact code::
pl: Używając tych sposobów postępowania możesz napisać ładny zgrabny kod::

source: import cgi form = cgi.FieldStorage() user = form.getfirst("user", "").upper() # This way it's safe. for item in form.getlist("item"): do_something(item)
pl: import cgi form = cgi.FieldStorage() user = form.getfirst("user", "").upper() # Tym sposobem jest bezpiecznie. for item in form.getlist("item"): do_something(item)

source: Functions
pl: Zadania

source: These are useful if you want more control, or if you want to employ some of the algorithms implemented in this module in other circumstances.
pl: Te są użyteczne jeśli chcesz więcej kontrolować, lub jeśli chcesz zatrudnić niektóre z algorytmów wypełnionych w tym module w innych przypadkach.

source: Parse a query in the environment or from a file (the file defaults to ``sys.stdin``). The *keep_blank_values* and *strict_parsing* parameters are passed to :func:`urllib.parse.parse_qs` unchanged.
pl: Wczytaj zapytanie w środowisku lub z pliku (plik domyślnie równy jest ``sys.stdin``). Parametry *keep_blank_values* i *strict_parsing* są przekazywane dla zadania :func:`urllib.parse.parse_qs` bez zmian.

source: This function is deprecated in this module. Use :func:`urllib.parse.parse_qs` instead. It is maintained here only for backward compatibility.
pl: To zadanie jest przedawnione w tym module. Używaj zadania :func:`urllib.parse.parse_qs` zamiast tego. Jest ono utrzymywane tutaj tylko dla wstecznej zgodności.

source: Parse input of type :mimetype:`multipart/form-data` (for file uploads). Arguments are *fp* for the input file and *pdict* for a dictionary containing other parameters in the :mailheader:`Content-Type` header.
pl: Wczytaj wejście typu :mimetype:`multipart/form-data` (dla ładowania plików). Parametrami są *fp* dla wejściowego pliku i *pdict* dla słownika zawierającego inne parametry w nagłówku :mailheader:`Content-Type`

source: Returns a dictionary just like :func:`urllib.parse.parse_qs` keys are the field names, each value is a list of values for that field. This is easy to use but not much good if you are expecting megabytes to be uploaded --- in that case, use the :class:`FieldStorage` class instead which is much more flexible.
pl: Zwraca słownik taki jak wtedy, gdy klucze :func:`urllib.parse.parse_qs` są nazwami pól, każda wartość jest listą wartości dla tego pola. To jest łatwe w użyciu ale nie bardzo dobre jeśli spodziewasz się megabajtów do załadowania --- w tym przypadku, użyj uogólnienia :class:`FieldStorage` zamiast tego i uzyskasz rozwiązanie o wiele bardziej elastyczne.

source: Note that this does not parse nested multipart parts --- use :class:`FieldStorage` for that.
pl: Zauważ że to nie wczytuje zagnieżdżonych wieloczęściowych części --- użyj uogólnienia :class:`FieldStorage` dla tego.

source: Parse a MIME header (such as :mailheader:`Content-Type`) into a main value and a dictionary of parameters.
pl: Wczytaj nagłówek MIME (taki, jak :mailheader:`Content-Type`) do głównej wartości i słownika parametrów.

source: Robust test CGI script, usable as main program. Writes minimal HTTP headers and formats all information provided to the script in HTML form.
pl: Wydajny testowy skrypt CGI, użyteczny jako program główny. Zapisuje minimalne nagłówki HTTP i formatuje całą informację dostarczoną dla skryptu w formularzu HTML.

source: Format the shell environment in HTML.
pl: Formatuje środowisko powłoki w HTML-u

source: Format a form in HTML.
pl: Formatuje formularz w HTML-u.

source: Format the current directory in HTML.
pl: Formatuje obecny katalog w HTML-u.

source: Print a list of useful (used by CGI) environment variables in HTML.
pl: Drukuje listę użytecznych (używanych przez CGI) zmiennych środowiskowych w HTML-u.

source: Convert the characters ``'&'``, ``'<'`` and ``'>'`` in string *s* to HTML-safe sequences. Use this if you need to display text that might contain such characters in HTML. If the optional flag *quote* is true, the quotation mark character (``'"'``) is also translated; this helps for inclusion in an HTML attribute value, as in ``<A HREF="...">``. If the value to be quoted might include single- or double-quote characters, or both, consider using the :func:`quoteattr` function in the :mod:`xml.sax.saxutils` module instead.
pl: Zamienia znaki ``'&'``, ``'<'`` i ``'>'`` w ciągu *s* do sekwencji bezpiecznych dla HTML-a. Użyj tego jeśli potrzebujesz wyświetlić tekst który może zawierać takie znaki w HTML-u. Jeśli opcjonalna flaga *cytatu* - z ang. - *quote* jest prawdziwa, wtedy znak cytowania (``'"'``) jest także tłumaczony; To pomaga w załączaniu w HTML-u wartości właściwości jak w ``<A HREF="...">``. Jeśli wartość do cytowania może zawierać pojedyncze lub podwójne znaki cytowania, lub oba, weź pod uwagę użycie zadania :func:`quoteattr` z modułu :mod:`xml.sax.saxutils` zamiast tego.

source: Caring about security
pl: Troska o bezpieczeństwo

source: There's one important rule: if you invoke an external program (via the :func:`os.system` or :func:`os.popen` functions. or others with similar functionality), make very sure you don't pass arbitrary strings received from the client to the shell. This is a well-known security hole whereby clever hackers anywhere on the Web can exploit a gullible CGI script to invoke arbitrary shell commands. Even parts of the URL or field names cannot be trusted, since the request doesn't have to come from your form!
pl: Istnieje jedna istotna zasada: Jeśli wywołujesz zewnętrzny program (przez zadanie :func:`os.system` lub :func:`os.popen` lub inne o podobnym działaniu), upewnij się bardzo że nie przekazujesz dowolnych ciągów znaków otrzymanych od klienta do powłoki. To jest bardzo znana luka bezpieczeństwa gdzie sprytni hakerzy dowolnie w sieci mogą wykorzystać naiwny skrypt CGI aby wywołać dowolną komendę powłoki. Nawet częściom adresu URL lub nazwom pól nie można ufać, gdyż zapytanie może nie pochodzić z formularza!

source: To be on the safe side, if you must pass a string gotten from a form to a shell command, you should make sure the string contains only alphanumeric characters, dashes, underscores, and periods.
pl: Aby trzymać się bezpiecznej strony, jeśli przekazujesz ciąg znaków otrzymany z formularza do polecenia powłoki, powinieneś upewnić się, że ciąg znaków zawiera tylko znaki alfanumeryczne, ukośniki, podkreślenia i kropki.

source: Installing your CGI script on a Unix system
pl: Instalowanie twojego skryptu CGI na systemie Unix-owym

source: Read the documentation for your HTTP server and check with your local system administrator to find the directory where CGI scripts should be installed; usually this is in a directory :file:`cgi-bin` in the server tree.
pl: Przeczytaj dokumentację dla twojego serwera HTTP i sprawdź u swojego administratora systemu aby dowiedzieć się który katalog powinien być użyty dla instalowania skryptów CGI; zwykle to jest katalog :file:`cgi-bin` w drzewie serwera.

source: Make sure that your script is readable and executable by "others"; the Unix file mode should be ``0o755`` octal (use ``chmod 0755 filename``). Make sure that the first line of the script contains ``#!`` starting in column 1 followed by the pathname of the Python interpreter, for instance::
pl: Upewnij się że twój skrypt jest czytelny i wykonywalny przez "innych"; tryb pliku Unix-a powinien być ``0o755`` ósemkowo (użyj ``chmod 0755 nazwa-pliku``). Upewnij się, że pierwsza linia skryptu zawiera ``#!`` zaczynając w kolumnie 1 po której następuje ścieżka dostępu do pliku programu interpretującego polecenia języka pytonowskiego, dla przykładu::

source: Make sure the Python interpreter exists and is executable by "others".
pl: Upewnij się że program interpretujący polecenia języka pytonowskiego istnieje i jest wykonywalny przez "innych".

source: Make sure that any files your script needs to read or write are readable or writable, respectively, by "others" --- their mode should be ``0o644`` for readable and ``0o666`` for writable. This is because, for security reasons, the HTTP server executes your script as user "nobody", without any special privileges. It can only read (write, execute) files that everybody can read (write, execute). The current directory at execution time is also different (it is usually the server's cgi-bin directory) and the set of environment variables is also different from what you get when you log in. In particular, don't count on the shell's search path for executables (:envvar:`PATH`) or the Python module search path (:envvar:`PYTHONPATH`) to be set to anything interesting.
pl: Upewnij się, że jakiekolwiek pliki które twój skrypt chce odczytać lub zapisać są czytelne i możliwe do zapisania odpowiednio, przez "innych" --- ich tryb powinien być ``0o644`` dla czytelnych i 0o666`` dla możliwych do zapisania. To jest ponieważ z powodów bezpieczeństwa, serwer HTTP wykonuje twój skrypt jako użytkownik "nikt" - z ang. - "nobody" bez żadnych szczególnych przywilejów. Może tylko wczytywać (zapisywać, wykonywać) pliki które wszyscy mogą czytać (zapisać, wykonać). Bierzący katalog w czasie wykonania jest także inny (jest to zwykle katalog serwera cgi-bin) i ustawienie zmiennych środowiskowych jest także inne od tego które dostajesz gdy się zalogujesz. W szczególności, nie licz na ścieżkę przeszukiwania pod kątem plików wykonywalnych (:envvar:`PATH`) ani na ścieżkę przeszukiwania modułów języka pytonowskiego (:envvar:`PYTHONPATH`), że będą ustawione na cokolwiek interesującego.

source: If you need to load modules from a directory which is not on Python's default module search path, you can change the path in your script, before importing other modules. For example::
pl: Jeśli potrzebujesz załadować moduły z katalogu który nie jest domyślną ścieżką przeszukiwania modułów języka pytonowskiego, możesz zmienić ścieżkę w twoim skrypcie, przez importowaniem innych modułów. Dla przykładu::

source: (This way, the directory inserted last will be searched first!)
pl: (W ten sposób, katalog wstawiony jako ostatni będzie przeszukiwany jako pierwszy!)

source: Instructions for non-Unix systems will vary; check your HTTP server's documentation (it will usually have a section on CGI scripts).
pl: Instrukcje dla nie-Unixowych systemów będą różne; Sprawdź dokumentację serwera HTTP (będzie zwykle miała sekcję o skryptach CGI).

source: Testing your CGI script
pl: Sprawdzanie twoich skryptów CGI

source: Unfortunately, a CGI script will generally not run when you try it from the command line, and a script that works perfectly from the command line may fail mysteriously when run from the server. There's one reason why you should still test your script from the command line: if it contains a syntax error, the Python interpreter won't execute it at all, and the HTTP server will most likely send a cryptic error to the client.
pl: Niestety, skrypt CGI zwykle nie uruchomi się gdy spróbujesz go uruchomić z wiersza poleceń i skrypt który działa dobrze z wiersza polecenia może zawieźć nieoczekiwanie gdy uruchomiony z serwera. Jest jeden powód dla którego wciąż powinieneś testować swój skrypt z wiersza polecenia: jeśli zawiera błąd składniowy, program interpretujący polecenia języka pytonowskiego nie wykona go w ogóle, a serwer HTTP najprawdopodobniej wyśle tajemniczy komunikat o błędzie do klienta.

source: Assuming your script has no syntax errors, yet it does not work, you have no choice but to read the next section.
pl: Zakładając, że twój skrypt nie ma błędów składniowych, a jednak wciąż nie działa, nie masz wyboru, tylko musisz czytać dalej.

source: Debugging CGI scripts
pl: Odpluskwianie skryptów CGI
